test-results/springboot3_ab.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8081

Document Path:          /api/departments?page=0&size=10
Document Length:        357 bytes

Concurrency Level:      20
Time taken for tests:   0.107 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      110200 bytes
HTML transferred:       71400 bytes
Requests per second:    1862.02 [#/sec] (mean)
Time per request:       10.741 [ms] (mean)
Time per request:       0.537 [ms] (mean, across all concurrent requests)
Transfer rate:          1001.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.9      1       6
Processing:     4    9   3.0      9      17
Waiting:        3    8   2.9      8      17
Total:          4   10   3.1     10      18

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     11
  75%     12
  80%     12
  90%     14
  95%     16
  98%     17
  99%     17
 100%     18 (longest request)